Repository: Dreille1980/planea
Catalog: Planea-iOS/Planea/Planea/*.lproj/Localizable.strings
Languages: fr

# usage.limit.feature.history
source: Recipe and plan history
fr: Historique des recettes et plans

# usage.limit.feature.settings
source: All settings
fr: Tous les paramètres

# usage.limit.share.button
source: Share with Friends
fr: Partager avec des amis

# usage.limit.share.message
source: I'm loving Planea for meal planning! Check it out: https://apps.apple.com/app/planea
fr: J'adore Planea pour planifier mes repas! Découvrez-le : https://apps.apple.com/app/planea

# usage.limit.feedback.button
source: Send Feedback
fr: Envoyer un commentaire

# usage.limit.feedback.subject
source: Planea Feedback
fr: Commentaires Planea

# usage.limit.feedback.body
source: Hi! I'd like to share some feedback about Planea:
fr: Bonjour! J'aimerais partager des commentaires sur Planea :

# usage.limit.chat.disabled
source: Chat is disabled when you've reached your monthly limit. Come back next month!
fr: Le chat est désactivé lorsque vous avez atteint votre limite mensuelle. Revenez le mois prochain!

# recipes.segment.recipes
source: Recipes
fr: Recettes

# recipes.segment.mealPrep
source: Meal prep
fr: Prépa-repas

# meal_prep_title
source: Meal Prep
fr: Prépa-repas

# meal_prep_subtitle
source: Plan and prepare your meals ahead of time with smart recipes
fr: Planifiez et préparez vos repas à l'avance avec des recettes intelligentes

# meal_prep_create_button
source: Create Meal Prep
fr: Créer une prépa-repas

# meal_prep_recommended_kits
source: Recommended Kits
fr: Kits recommandés

# meal_prep_history_title
source: Past Meal Preps
fr: Prépa-repas passées

# meal_prep_choose_kit
source: Choose This Kit
fr: Choisir ce kit

# meal_prep_replay
source: Replay
fr: Rejouer

# meal_prep_completed_date
source: Week of %@
fr: Semaine du %@

# mealprep.title
source: Meal prep
fr: Prépa-repas

# mealprep.subtitle
source: Plan your week's meals ahead of time.
fr: Planifiez vos repas de la semaine en avance.

# mealprep.cta
source: Create my meal prep
fr: Créer ma prépa-repas

# mealprep.recommendedKits
source: Recommended kits
fr: Kits recommandés

# mealprep.history
source: My past meal preps
fr: Mes prépas-repas passées

# mealprep.replay
source: Replay
fr: Rejouer

# mealprep.chooseKit
source: Choose this kit
fr: Choisir ce kit

# mealprep.viewDetails
source: View details
fr: Voir le détail

# mealprep.wizard.step1
source: Settings
fr: Paramètres

# mealprep.wizard.step2
source: Preferences
fr: Préférences

# mealprep.wizard.step3
source: Choose kit
fr: Choix du kit

# mealprep.wizard.next
source: Next
fr: Suivant

# mealprep.wizard.back
source: Back
fr: Retour

# mealprep.wizard.generate
source: Generate kits
fr: Générer les kits

# mealprep.wizard.confirm
source: Confirm
fr: Confirmer

# mealprep.wizard.days
source: Days covered
fr: Jours couverts

# mealprep.wizard.meals
source: Meals to cover
fr: Repas à couvrir

# mealprep.wizard.servings
source: Servings per meal
fr: Portions par repas

# mealprep.wizard.servingsCount
source: servings
fr: portions

# mealprep.days.monToFri
source: Monday to Friday
fr: Lundi à vendredi

# mealprep.days.monToSun
source: Monday to Sunday
fr: Lundi à dimanche

# mealprep.days.custom
source: Custom
fr: Personnalisé

# mealprep.prepTime
source: Total prep time
fr: Temps total de prépa

# mealprep.skillLevel
source: Level
fr: Niveau

# mealprep.skill.beginner
source: Beginner
fr: Débutant

# mealprep.skill.intermediate
source: Intermediate
fr: Intermédiaire

# mealprep.options.rareIngredients
source: Limit rare ingredients
fr: Limiter les ingrédients rares

# mealprep.options.longShelfLife
source: Prefer recipes that keep 3-4 days
fr: Recettes qui se conservent 3-4 jours

# mealprep.kit.meals
source: meals
fr: repas

# mealprep.kit.portions
source: servings
fr: portions

# mealprep.kit.prepTime
source: Prep time
fr: Temps de prépa

# mealprep.kit.recipes
source: Included recipes
fr: Recettes incluses

# mealprep.storage.days
source: Keeps %d days in the fridge
fr: Se conserve %d jours au frigo

# mealprep.storage.freezable
source: Freezable
fr: Se congèle

# mealprep.storage.notFreezable
source: Not suitable for freezing
fr: Ne se congèle pas

# mealprep.storage.freezeAfterPrep
source: Freeze after preparation
fr: À congeler après la préparation

# mealprep.history.number
source: Meal prep #%d
fr: Prépa-repas #%d

# mealprep.history.portions
source: %d servings
fr: %d portions

# mealprep.history.completedOn
source: Completed %@
fr: Fait le %@

# mealprep.history.empty
source: No past meal preps
fr: Aucune prépa-repas dans l'historique

# meal_prep_wizard_title
source: Meal Prep Wizard
fr: Assistant Prépa-repas

# meal_prep_step1_title
source: Configure Your Week
fr: Configurer votre semaine

# meal_prep_step1_subtitle
source: Choose the days and meals you want to prepare
fr: Choisissez les jours et repas à préparer

# meal_prep_days_covered
source: Days covered
fr: Jours couverts

# meal_prep_meals_to_cover
source: Meals to cover
fr: Repas à couvrir

# meal_prep_servings_per_meal
source: Servings per meal
fr: Portions par repas

# meal_prep_family_size_hint
source: Your family has %d members
fr: Votre famille compte %d membres

source: Next
fr: Suivant

source: Back
fr: Retour

# meal_prep_generate_kits
source: Generate Kits
fr: Générer les kits

source: Confirm
fr: Confirmer

# meal_prep_step2_title
source: Your Preferences
fr: Vos préférences

# meal_prep_step2_subtitle
source: Help us tailor the recipes to your needs
fr: Aidez-nous à adapter les recettes à vos besoins

# meal_prep_total_prep_time
source: Total prep time
fr: Temps total de prépa

# meal_prep_skill_level
source: Skill level
fr: Niveau de compétence

# meal_prep_options
source: Additional Options
fr: Options additionnelles

# meal_prep_avoid_rare
source: Avoid rare ingredients
fr: Éviter les ingrédients rares

# meal_prep_avoid_rare_hint
source: Focus on common, easy-to-find ingredients
fr: Se concentrer sur des ingrédients courants et faciles à trouver

# meal_prep_prefer_long_shelf
source: Prefer longer shelf life
fr: Préférer une longue conservation

# meal_prep_prefer_long_shelf_hint
source: Prioritize recipes that keep well for 3-4 days
fr: Prioriser les recettes qui se conservent bien 3-4 jours

# meal_prep_step3_title
source: Choose Your Kit
fr: Choisissez votre kit

# meal_prep_generating
source: Generating your meal prep kits...
fr: Génération de vos kits de prépa-repas...

# meal_prep_step3_subtitle
source: Select the kit that best fits your needs
fr: Sélectionnez le kit qui convient le mieux à vos besoins

# meal_prep_please_wait
source: This may take a moment...
fr: Cela peut prendre un moment...

# meal_prep.concept_selection.title
source: Choose a Theme
fr: Choisissez un thème

# meal_prep.concept_selection.subtitle
source: Select a concept or describe your own theme
fr: Sélectionnez un concept ou décrivez votre propre thème

# meal_prep.concept_selection.custom
source: Or describe your own theme
fr: Ou décrivez votre propre thème

# meal_prep.concept_selection.custom_placeholder
source: Ex: Asian cuisine with lots of vegetables
fr: Ex: Cuisine asiatique avec beaucoup de légumes

# meal_prep.confirmation.title
source: Confirm Your Plan
fr: Confirmez votre plan

# meal_prep.confirmation.subtitle
source: Here's how your recipes will be distributed
fr: Voici comment vos recettes seront distribuées

# meal_prep.freezable
source: Freezable
fr: Congélable

# meal_prep.not_freezable
source: Not freezable
fr: Non congélable

# meal_prep.recipes_included
source: Recipes Included
fr: Recettes incluses

# meal_prep.storage
source: Storage
fr: Conservation

# meal_prep.total_time
source: Total time
fr: temps total

# meal_prep.detail.recipes_tab
source: Recipes
fr: Recettes

# meal_prep.detail.preparation_tab
source: Preparation
fr: Préparation

# meal_prep.detail.recipes_section
source: Recipes Included
fr: Recettes incluses

# meal_prep.detail.recipes_count
source: recipes
fr: recettes

# meal_prep.detail.grouped_prep_title
source: Grouped Preparation Steps
fr: Étapes de préparation groupées

# meal_prep.detail.no_grouped_steps
source: No grouped preparation steps available
fr: Aucune étape de préparation groupée disponible

# meal_prep.detail.no_grouped_steps_hint
source: Grouped preparation steps will be available when generated by the backend
fr: Les étapes de préparation groupées seront disponibles lorsqu'elles seront générées par le backend

# meal_prep.detail.ingredients
source: Ingredients
fr: Ingrédients

# meal_prep.ingredients_added_toast
source: Ingredients added to shopping list
fr: Ingrédients ajoutés à la liste d'épicerie
