Repository: Dreille1980/planea
Catalog: Planea-iOS/Planea/Planea/*.lproj/Localizable.strings
Languages: fr

# legal.privacy.content
source: PRIVACY POLICY Last updated: January 2025 1. INTRODUCTION Planea ("we," "our," or "us") respects your privacy and is committed to protecting your personal data. This Privacy Policy explains how we collect, use, and protect your information when you use our App. 2. INFORMATION WE COLLECT 2.1 Information You Provide: - Family profile information (names, dietary preferences, allergies, dislikes) - Meal plans and recipes you create or save - Shopping lists - App preferences and settings 2.2 Automatically Collected Information: - Device information (iOS version, device model) - App usage data (features used, time spent) - Crash reports and performance data 2.3 AI Service Data: - Recipe generation prompts - Meal planning preferences - This data is processed by our AI service provider (OpenAI/Anthropic) according to their privacy policies 3. HOW WE USE YOUR INFORMATION We use your information to: - Provide and improve the App's functionality - Generate personalized meal plans and recipes - Process your subscription - Send important updates about the App - Analyze usage patterns to improve our services - Provide customer support 4. DATA STORAGE AND SECURITY 4.1 Your data is primarily stored locally on your device using Apple's Core Data framework. 4.2 Subscription information is managed through Apple's App Store. 4.3 AI-generated content requests are sent to our service providers with appropriate security measures. 4.4 We implement industry-standard security measures to protect your data. 5. DATA SHARING We do not sell your personal information. We may share data with: - AI service providers (OpenAI/Anthropic) for recipe generation - Apple for subscription management - Analytics services (anonymized data only) 6. YOUR RIGHTS You have the right to: - Access your personal data - Correct inaccurate data - Delete your data (by deleting the App) - Export your data - Opt out of analytics 7. CHILDREN'S PRIVACY Our App is not intended for children under 13. We do not knowingly collect data from children under 13. 8. THIRD-PARTY SERVICES 8.1 OpenAI/Anthropic API: Used for AI recipe generation. Their privacy policies apply to data sent to their services. 8.2 Apple Services: Subscription and payment data is handled by Apple according to their privacy policy. 9. DATA RETENTION We retain your data as long as you use the App. When you delete the App, all locally stored data is removed from your device. 10. INTERNATIONAL DATA TRANSFERS Your data may be processed in countries outside your country of residence, including the United States, where our AI service providers operate. 11. CHANGES TO THIS POLICY We may update this Privacy Policy from time to time. We will notify you of significant changes through the App. 12. COOKIES AND TRACKING We do not use cookies or web tracking technologies. All data is stored locally on your device. 13. CONTACT US For questions about this Privacy Policy or to exercise your rights, please contact us: - Through the App's feedback feature - Email: dreyerfred+privacyplanea@gmail.com 14. GDPR COMPLIANCE (FOR EU USERS) If you are in the European Union, you have additional rights under GDPR: - Right to data portability - Right to restriction of processing - Right to object to processing - Right to lodge a complaint with a supervisory authority
fr: POLITIQUE DE CONFIDENTIALITÉ Dernière mise à jour : Janvier 2025 1. INTRODUCTION Planea ("nous", "notre" ou "nos") respecte votre vie privée et s'engage à protéger vos données personnelles. Cette Politique de confidentialité explique comment nous collectons, utilisons et protégeons vos informations lorsque vous utilisez notre Application. 2. INFORMATIONS QUE NOUS COLLECTONS 2.1 Informations que vous fournissez : - Informations de profil familial (noms, préférences alimentaires, allergies, aliments non aimés) - Plans de repas et recettes que vous créez ou sauvegardez - Listes d'épicerie - Préférences et paramètres de l'application 2.2 Informations collectées automatiquement : - Informations sur l'appareil (version iOS, modèle d'appareil) - Données d'utilisation de l'application (fonctionnalités utilisées, temps passé) - Rapports de plantage et données de performance 2.3 Données du service IA : - Demandes de génération de recettes - Préférences de planification de repas - Ces données sont traitées par notre fournisseur de services IA (OpenAI/Anthropic) selon leurs politiques de confidentialité 3. COMMENT NOUS UTILISONS VOS INFORMATIONS Nous utilisons vos informations pour : - Fournir et améliorer les fonctionnalités de l'Application - Générer des plans de repas et recettes personnalisés - Traiter votre abonnement - Envoyer des mises à jour importantes concernant l'Application - Analyser les modèles d'utilisation pour améliorer nos services - Fournir un support client 4. STOCKAGE ET SÉCURITÉ DES DONNÉES 4.1 Vos données sont principalement stockées localement sur votre appareil en utilisant le framework Core Data d'Apple. 4.2 Les informations d'abonnement sont gérées via l'App Store d'Apple. 4.3 Les demandes de contenu généré par IA sont envoyées à nos fournisseurs de services avec des mesures de sécurité appropriées. 4.4 Nous mettons en œuvre des mesures de sécurité standard de l'industrie pour protéger vos données. 5. PARTAGE DE DONNÉES Nous ne vendons pas vos informations personnelles. Nous pouvons partager des données avec : - Fournisseurs de services IA (OpenAI/Anthropic) pour la génération de recettes - Apple pour la gestion des abonnements - Services d'analyse (données anonymisées uniquement) 6. VOS DROITS Vous avez le droit de : - Accéder à vos données personnelles - Corriger les données inexactes - Supprimer vos données (en supprimant l'Application) - Exporter vos données - Refuser les analyses 7. CONFIDENTIALITÉ DES ENFANTS Notre Application n'est pas destinée aux enfants de moins de 13 ans. Nous ne collectons pas sciemment de données auprès d'enfants de moins de 13 ans. 8. SERVICES TIERS 8.1 API OpenAI/Anthropic : Utilisée pour la génération de recettes par IA. Leurs politiques de confidentialité s'appliquent aux données envoyées à leurs services. 8.2 Services Apple : Les données d'abonnement et de paiement sont gérées par Apple selon leur politique de confidentialité. 9. CONSERVATION DES DONNÉES Nous conservons vos données tant que vous utilisez l'Application. Lorsque vous supprimez l'Application, toutes les données stockées localement sont supprimées de votre appareil. 10. TRANSFERTS INTERNATIONAUX DE DONNÉES Vos données peuvent être traitées dans des pays en dehors de votre pays de résidence, y compris aux États-Unis, où nos fournisseurs de services IA opèrent. 11. MODIFICATIONS DE CETTE POLITIQUE Nous pouvons mettre à jour cette Politique de confidentialité de temps en temps. Nous vous informerons des modifications importantes via l'Application. 12. COOKIES ET SUIVI Nous n'utilisons pas de cookies ou de technologies de suivi web. Toutes les données sont stockées localement sur votre appareil. 13. NOUS CONTACTER Pour toute question concernant cette Politique de confidentialité ou pour exercer vos droits, veuillez nous contacter : - Via la fonction de feedback de l'Application - Courriel : dreyerfred+privacyplanea@gmail.com 14. CONFORMITÉ RGPD (POUR LES UTILISATEURS DE L'UE) Si vous êtes dans l'Union européenne, vous disposez de droits supplémentaires en vertu du RGPD : - Droit à la portabilité des données - Droit à la limitation du traitement - Droit d'opposition au traitement - Droit de déposer une plainte auprès d'une autorité de contrôle

# usage.limit_reached
source: Monthly limit reached
fr: Limite mensuelle atteinte

# usage.limit_message
source: You've used your 15 free recipes this month. Upgrade to Premium for unlimited access.
fr: Vous avez utilisé vos 15 recettes gratuites ce mois-ci. Passez à Premium pour un accès illimité.

# usage.remaining
source: %d/15 recipes
fr: %d/15 recettes

# usage.unlimited
source: Unlimited ✨
fr: Illimité ✨

# usage.premium_feature
source: Premium Feature
fr: Fonction Premium

# usage.monthly
source: Monthly Usage
fr: Utilisation mensuelle

# prefs.generation
source: Generation Preferences
fr: Préférences de génération

# prefs.title
source: Recipe Preferences
fr: Préférences de recettes

# prefs.time
source: Cooking Time
fr: Temps de cuisson

# prefs.time.footer
source: Maximum cooking time for weekdays and weekends
fr: Temps de cuisson maximum pour la semaine et les weekends

# prefs.weekday
source: Weekday Maximum
fr: Maximum semaine

# prefs.weekend
source: Weekend Maximum
fr: Maximum weekend

# prefs.spice
source: Spice Level
fr: Niveau d'épices

# prefs.proteins
source: Preferred Proteins
fr: Protéines préférées

# prefs.proteins.footer
source: Select your preferred protein sources
fr: Sélectionnez vos sources de protéines préférées

# prefs.appliances
source: Available Equipment
fr: Équipement disponible

# prefs.appliances.footer
source: Equipment you have available for cooking
fr: Équipement dont vous disposez pour cuisiner

# prefs.options
source: Additional Options
fr: Options additionnelles

# prefs.kidfriendly
source: Kid-Friendly Meals
fr: Repas adaptés aux enfants

# prefs.kidfriendly.footer
source: Prefer meals suitable for children
fr: Préférer des repas adaptés aux enfants

# prefs.reset
source: Reset to Defaults
fr: Réinitialiser par défaut

# prefs.calendar
source: Calendar
fr: Calendrier

# prefs.weekstart
source: Week Starts On
fr: Premier jour de la semaine

# prefs.weekstart.footer
source: Choose the first day of your week
fr: Choisissez le premier jour de votre semaine

# spice.none
source: None
fr: Aucun

# spice.mild
source: Mild
fr: Doux

# spice.medium
source: Medium
fr: Moyen

# spice.hot
source: Hot
fr: Fort

# appliance.oven
source: Oven
fr: Four

# appliance.bbq
source: BBQ/Grill
fr: BBQ/Gril

# appliance.airfryer
source: Air Fryer
fr: Friteuse à air

# appliance.slowcooker
source: Slow Cooker
fr: Mijoteuse

# appliance.microwave
source: Microwave
fr: Micro-ondes

# protein.chicken
source: Chicken
fr: Poulet

# protein.beef
source: Beef
fr: Bœuf

# protein.pork
source: Pork
fr: Porc

# protein.fish
source: Fish
fr: Poisson

# protein.seafood
source: Seafood
fr: Fruits de mer

# protein.legumes
source: Legumes
fr: Légumineuses

# protein.eggs
source: Eggs
fr: Œufs

# settings.support
source: Support & Feedback
fr: Support et commentaires

# settings.contact
source: Contact Us
fr: Nous contacter

# settings.feedback
source: Send Feedback
fr: Envoyer un commentaire

# settings.reportBug
source: Report a Bug
fr: Signaler un bug

# settings.featureRequest
source: Suggest a Feature
fr: Suggérer une fonctionnalité

# feedback.subject
source: Feedback - Planea iOS
fr: Commentaire - Planea iOS

# feedback.body
source: Please share your feedback or report any issues: --- App Version: %@ iOS Version: %@ Device: %@
fr: Veuillez partager vos commentaires ou signaler tout problème : --- Version de l'app : %@ Version iOS : %@ Appareil : %@

# feedback.sent
source: Thank you for your feedback!
fr: Merci pour votre commentaire !

# feedback.error
source: Could not open email. Please email us at dreyerfred+planea@gmail.com
fr: Impossible d'ouvrir l'email. Veuillez nous écrire à dreyerfred+planea@gmail.com

# recipe.addedToList
source: Added to Shopping List
fr: Ajouté à la liste d'épicerie

# recipe.addedToList.message
source: Ingredients have been added to your shopping list.
fr: Les ingrédients ont été ajoutés à votre liste d'épicerie.

# recipe.listCreated
source: Shopping List Created
fr: Liste d'épicerie créée

# recipe.listCreated.message
source: A new shopping list has been created with these ingredients.
fr: Une nouvelle liste d'épicerie a été créée avec ces ingrédients.

# plan.draft
source: Draft
fr: Brouillon

# plan.active.badge
source: Weekly Plan
fr: Plan de la semaine

# plan.activate.button
source: Save as Weekly Plan
fr: Sauvegarder comme plan de la semaine

# plan.archive.alert.title
source: Create New Plan?
fr: Créer un nouveau plan?

# plan.archive.alert.message
source: Your current plan will be archived to history. Continue?
fr: Votre plan actuel sera archivé dans l'historique. Continuer?

# plan.archive.alert.confirm
source: Archive and Create
fr: Archiver et créer

# plan.confirmPlan
source: Confirm Plan
fr: Confirmer le plan

# plan.confirmAlert.title
source: Archive Current Plan?
fr: Archiver le plan actuel ?

# plan.confirmAlert.message
source: The current plan will be saved to history before creating a new plan.
fr: Le plan actuel sera enregistré dans l'historique avant de créer un nouveau plan.

# plan.confirmAlert.archive
source: Archive and Continue
fr: Archiver et continuer

# plan.namePlan.title
source: Name Your Plan
fr: Nommer le plan

# plan.namePlan.placeholder
source: e.g., Meals for the week of October 19
fr: Ex: Repas de la semaine du 19 octobre

# plan.namePlan.message
source: Give this plan a name to make it easier to find in history (optional)
fr: Donnez un nom à ce plan pour faciliter sa recherche dans l'historique (optionnel)

# plan.history.title
source: Plan History
fr: Historique des plans

# plan.history.weekOf
source: Week of %@
fr: Semaine du %@

# plan.history.restore
source: Restore as Draft
fr: Restaurer comme brouillon

# plan.history.empty
source: No plans in history
fr: Aucun plan dans l'historique

# recent.recipes.title
source: Recent Recipes
fr: Recettes récentes

# recent.recipes.saved
source: Recipe saved
fr: Recette sauvegardée

# recent.recipes.source.text
source: Generated by text
fr: Générée par texte

# recent.recipes.source.photo
source: Generated by photo
fr: Générée par photo

# recent.recipes.empty
source: No recent recipes
fr: Aucune recette récente

# recent.recipes.addToPlan
source: Add to Plan
fr: Ajouter au plan

# meal.selectSlot
source: Select a Slot
fr: Sélectionner une période

# week.day
source: Day
fr: Jour

source: Meal Type
fr: Type de repas

# adhoc.complexity
source: Recipe Complexity
fr: Complexité de la recette

# adhoc.complexity.intermediate
source: Intermediate - 30-60 min
fr: Intermédiaire - 30-60 min

# adhoc.complexity.advanced
source: Advanced - > 60 min
fr: Avancé - > 60 min

# prefs.flyers.title
source: Weekly Flyer Deals
fr: Rabais des circulaires

# prefs.flyers.enabled
source: Use Weekly Flyer Deals
fr: Utiliser les rabais des circulaires

# prefs.flyers.postalcode
source: Postal Code
fr: Code postal

# prefs.flyers.store
source: Preferred Grocery Store
fr: Épicerie préférée

# prefs.flyers.footer
source: Generate recipes based on deals from your local grocery store. Enter your postal/ZIP code and store name (e.g., IGA, Metro, Walmart, Kroger).
fr: Génère des recettes basées sur les rabais de votre épicerie locale. Entrez votre code postal et le nom de votre épicerie (ex: IGA, Metro, Provigo, Maxi).

# tour.welcome.title
source: Welcome to Planea
fr: Bienvenue dans Planea

# tour.welcome.description
source: Your intelligent assistant for meal planning
fr: Votre assistant intelligent pour planifier vos repas

# tour.mealplans.title
source: Plan Your Weeks
fr: Planifiez vos semaines

# tour.mealplans.description
source: Generate automatically or add meals manually
fr: Générez automatiquement ou ajoutez manuellement vos repas

# tour.adhoc.title
source: Instant Inspiration
fr: Inspiration instantanée

# tour.adhoc.description
source: Describe what you want or snap a photo of your fridge
fr: Décrivez ce que vous voulez ou prenez une photo de votre frigo

# tour.shopping.title
source: Smart List
fr: Liste intelligente

# tour.shopping.description
source: All your ingredients organized automatically
fr: Tous vos ingrédients organisés automatiquement

# tour.favorites.title
source: Never Lose Anything
fr: Ne perdez rien

# tour.favorites.description
source: Save your favorite recipes and access your history
fr: Sauvegardez vos recettes préférées et retrouvez votre historique

# tour.flyers.title
source: Save with Deals
fr: Économisez avec les rabais

# tour.flyers.description
source: Recipes adapted to weekly promotions
fr: Recettes adaptées aux promotions de la semaine

# tour.getstarted.title
source: Let's Set Things Up
fr: Paramétrons tout ça

# tour.getstarted.description
source: A few details about you and we're ready!
fr: Quelques infos sur vous et c'est parti!

# tour.skip
source: Skip
fr: Passer

# tour.next
source: Next
fr: Suivant

# tour.start
source: Get Started
fr: Commencer

# onboarding.familyname.title
source: What's Your Family Name?
fr: Comment s'appelle votre famille?

# onboarding.familyname.placeholder
source: The Smith Family
fr: Famille Tremblay

# onboarding.familyname.hint
source: Used to personalize your experience
fr: Utilisé pour personnaliser votre expérience

source: What's Your Family Name?
fr: Comment s'appelle votre famille?

source: Your Generation Preferences
fr: Vos préférences de génération

# onboarding.members.title
source: Family Members
fr: Membres de la famille

# action.continue
source: Continue
fr: Continuer

# onboarding.members.subtitle
source: Add people who will share these meals
fr: Ajoutez les personnes qui partageront ces repas

# onboarding.members.add
source: Add Member
fr: Ajouter un membre

# onboarding.members.addanother.title
source: Add Another Member?
fr: Ajouter un autre membre?

# onboarding.members.addanother.message
source: Would you like to add another family member?
fr: Voulez-vous ajouter un autre membre de la famille?

# onboarding.members.addanother.yes
source: Yes
fr: Oui

# onboarding.members.addanother.no
source: No, Continue
fr: Non, continuer

# onboarding.members.addanother.later
source: Later
fr: Plus tard

# onboarding.member.configure
source: Configure
fr: Configurer

# onboarding.member.configured
source: Configured ✓
fr: Configuré ✓

# onboarding.member.title
source: Member Configuration
fr: Configuration du membre

# onboarding.member.diets.footer
source: Select all applicable dietary preferences
fr: Sélectionnez tous les régimes alimentaires applicables

# onboarding.member.allergens.footer
source: Important to avoid allergic reactions
fr: Important pour éviter les réactions allergiques

# onboarding.member.dislikes.footer
source: Foods this member doesn't like
fr: Aliments que ce membre n'aime pas

# onboarding.prefs.title
source: Your Generation Preferences
fr: Vos préférences de génération

# onboarding.prefs.subtitle
source: Customize how we create your recipes
fr: Personnalisez la façon dont nous créons vos recettes

# onboarding.prefs.premium.message
source: Unlock all options with Premium
fr: Débloquez toutes les options avec Premium

# onboarding.completion.title
source: All Set!
fr: Tout est prêt!

# onboarding.completion.subtitle
source: Your family profile is configured
fr: Votre profil familial est configuré

# onboarding.completion.family
source: Family
fr: Famille

# onboarding.completion.members
source: Members
fr: Membres

# onboarding.completion.member
source: member
fr: membre

# onboarding.completion.members.plural
source: members
fr: membres

# onboarding.completion.configured
source: Configured
fr: Configurés

# onboarding.completion.start
source: Discover Planea
fr: Découvrir Planea

# settings.help
source: Help
fr: Aide

# settings.viewTour
source: View Tour Again
fr: Revoir la présentation

# chat.title
source: Planea Assistant
fr: Assistant Planea

# chat.input.placeholder
source: Ask me a question...
fr: Posez-moi une question...

# chat.welcome.title
source: Welcome to Planea Assistant
fr: Bienvenue dans l'Assistant Planea

# chat.welcome.subtitle
source: I'm here to help you with your meals and nutrition
fr: Je suis là pour vous aider avec vos repas et votre nutrition

# chat.feature.onboarding
source: Guided Setup
fr: Configuration guidée

# chat.feature.onboarding.desc
source: Configure your preferences in a few questions
fr: Configurez vos préférences en quelques questions

# chat.feature.recipeqa
source: Recipe Questions
fr: Questions sur les recettes

# chat.feature.recipeqa.desc
source: Substitutions, conversions, adjustments
fr: Substitutions, conversions, ajustements

# chat.feature.coach
source: Nutrition Coach
fr: Coach nutrition

# chat.feature.coach.desc
source: General advice on healthy eating
fr: Conseils généraux sur l'alimentation saine

# chat.action.new
source: New Conversation
fr: Nouvelle conversation

# chat.action.delete
source: Delete Conversation
fr: Supprimer la conversation

# chat.conversation.new
source: New Conversation
fr: Nouvelle conversation

# chat.offline.message
source: Agent requires internet connection
fr: L'agent nécessite une connexion internet

# chat.error.premium
source: Premium subscription required to use the conversational agent
fr: Abonnement Premium requis pour utiliser l'agent conversationnel

# chat.error.server
source: Server error
fr: Erreur serveur

# chat.error.network
source: Network error
fr: Erreur réseau

# chat.error.decode
source: Error decoding response
fr: Erreur de décodage de la réponse

# chat.pending_recipe.title
source: Proposed Recipe
fr: Recette proposée

# chat.pending_recipe.view
source: View Details
fr: Voir les détails

# chat.pending_recipe.confirm
source: Confirm
fr: Confirmer

# chat.pending_recipe.cancel
source: Cancel
fr: Annuler

# chat.confirm.button
source: Confirm
fr: Confirmer

# chat.cancel.button
source: Cancel
fr: Annuler

# chat.error.offline
source: Conversational agent requires an internet connection
fr: L'agent conversationnel nécessite une connexion internet

# chat.error.unknown
source: An error occurred
fr: Une erreur s'est produite

# agent.mode.onboarding
source: Setup
fr: Configuration

# agent.mode.recipeqa
source: Recipe Q&A
fr: Q&R Recettes

# freetrial.banner.title
source: Free Trial Active
fr: Essai gratuit actif

# freetrial.banner.daysLeft
source: %d days remaining
fr: %d jours restants

# freetrial.expired.title
source: Trial Ended
fr: Essai terminé

# freetrial.expired.message
source: Your 7-day free trial has ended. Continue enjoying all features by subscribing to Planea Premium, or keep using the free plan with limited recipe generation.
fr: Votre essai gratuit de 7 jours est terminé. Continuez à profiter de toutes les fonctionnalités en vous abonnant à Planea Premium, ou continuez avec le plan gratuit avec génération limitée de recettes.

# freetrial.expired.subscribe
source: Subscribe Now
fr: S'abonner maintenant

# freetrial.expired.continue
source: Continue with Free Plan
fr: Continuer avec le plan gratuit

# chat.meal_plan.current_plan
source: Current Plan
fr: Plan actuel

# chat.close
source: Close
fr: Fermer

# speech.error.not_authorized
source: Microphone access denied. Please enable it in Settings.
fr: Accès au microphone refusé. Veuillez l'activer dans les Réglages.

# speech.error.not_available
source: Speech recognition is not available on this device.
fr: La reconnaissance vocale n'est pas disponible sur cet appareil.

# speech.error.cannot_create_request
source: Cannot start speech recognition. Please try again.
fr: Impossible de démarrer la reconnaissance vocale. Veuillez réessayer.

# speech.error.generic
source: Voice input error. Please try text input.
fr: Erreur de saisie vocale. Veuillez utiliser la saisie texte.

# usage.limit.reached.title
source: Wow, you loved Planea! 🎉
fr: Wow, vous avez adoré Planea! 🎉

# usage.limit.reached.message
source: You've used your 30 generations this month. Come back on %@ to continue!
fr: Vous avez utilisé vos 30 générations ce mois-ci. Revenez le %@ pour continuer!

# usage.limit.accessible
source: You can still access:
fr: Vous pouvez toujours accéder à :

# usage.limit.feature.plans
source: Your existing meal plans
fr: Vos plans de repas existants

# usage.limit.feature.shopping
source: Shopping lists
fr: Listes d'épicerie

# usage.limit.feature.favorites
source: Saved recipes
fr: Recettes sauvegardées
