Repository: Dreille1980/planea
Catalog: Planea-iOS/Planea/Planea/*.lproj/Localizable.strings
Languages: fr

# tab.onboarding
source: Family
fr: Famille

# tab.recipes
source: Recipes
fr: Recettes

# tab.shopping
source: Groceries
fr: Épicerie

# tab.favorites
source: Favorites
fr: Favoris

# tab.settings
source: Settings
fr: Réglages

# onboarding.title
source: Setup Family
fr: Configurer la famille

# onboarding.family
source: Family
fr: Famille

# onboarding.familyName
source: Family name
fr: Nom de la famille

# onboarding.hint
source: Add members, allergies and preferences in the next step.
fr: Ajoutez vos membres, allergies et préférences dans la prochaine étape.

# plan.title
source: Week Plan
fr: Plan de la semaine

# plan.selectSlots
source: Select slots to generate
fr: Sélectionne les repas à générer

# recipes.weekPlan
source: Week Plan
fr: Plan

# week.monday
source: Monday
fr: Lundi

# week.tuesday
source: Tuesday
fr: Mardi

# week.wednesday
source: Wednesday
fr: Mercredi

# week.thursday
source: Thursday
fr: Jeudi

# week.friday
source: Friday
fr: Vendredi

# week.saturday
source: Saturday
fr: Samedi

# week.sunday
source: Sunday
fr: Dimanche

# meal.breakfast
source: Breakfast
fr: Déjeuner

# meal.lunch
source: Lunch
fr: Dîner

# meal.dinner
source: Dinner
fr: Souper

# meal.snack
source: Snack
fr: Collation

# action.generatePlan
source: Generate Plan
fr: Générer le plan

# action.generateRecipe
source: Generate Recipe
fr: Générer la recette

# action.exportText
source: Export (text)
fr: Exporter (texte)

# recipe.info
source: Information
fr: Informations

# recipe.servings
source: Servings
fr: Portions

# recipe.time
source: Total time
fr: Temps total

# recipe.ingredients
source: Ingredients
fr: Ingrédients

# recipe.steps
source: Steps
fr: Étapes

# shopping.title
source: Shopping List
fr: Liste d'épicerie

# shopping.sort.alphabetical
source: Alphabetical
fr: Alphabétique

# shopping.sort.storeLayout
source: Store Layout
fr: Ordre d'épicerie

# shopping.sort.custom
source: Custom
fr: Personnalisé

# adhoc.title
source: Ad hoc recipe
fr: Recette ad hoc

# adhoc.modeText
source: Text
fr: Texte

# adhoc.pantryScan
source: Pantry Scan
fr: Vide-frigo

# adhoc.promptPlaceholder
source: e.g., chicken + broccoli, 30 min, 4 servings
fr: Ex.: poulet + brocoli, 30 min, 4 portions

# adhoc.fridgePhoto
source: Fridge Photo
fr: Photo du frigo

# adhoc.takePhoto
source: Take a Photo
fr: Prendre une photo

# adhoc.choosePhoto
source: Choose a Photo
fr: Choisir une photo

# adhoc.analyzingPhoto
source: Analyzing photo...
fr: Analyse de la photo...

# adhoc.imageError
source: Error processing image
fr: Erreur lors du traitement de l'image

# settings.units
source: Units
fr: Unités

# settings.language
source: Language
fr: Langue

# settings.family
source: Family
fr: Famille

# settings.manageFamily
source: Manage Family
fr: Gérer la famille

# settings.members
source: member(s)
fr: membre(s)

# settings.preferences
source: Preferences
fr: Préférences

# units.metric
source: Metric
fr: Métrique

# units.imperial
source: Imperial
fr: Impérial

# lang.system
source: System
fr: Système

# member.name
source: Name
fr: Nom

# member.memberName
source: Member name
fr: Nom du membre

# member.dietaryPreferences
source: Dietary Preferences
fr: Préférences alimentaires

# member.allergens
source: Allergens
fr: Allergènes

# member.dislikes
source: Dislikes
fr: N'aime pas

# member.addDislike
source: Add dislike
fr: Ajouter un aliment non aimé

# member.editMember
source: Edit Member
fr: Modifier le membre

# family.members
source: Members
fr: Membres

# family.addMember
source: Add Member
fr: Ajouter un membre

source: Family Management
fr: Gestion de la famille

# onboarding.welcome
source: Welcome to Planea
fr: Bienvenue dans Planea

# onboarding.members
source: Family Members
fr: Membres de la famille

# onboarding.members.description
source: Add people in your household who will eat these meals. You can then set their allergies and preferences.
fr: Ajoutez les personnes de votre foyer qui mangeront ces repas. Vous pourrez ensuite définir leurs allergies et préférences.

# onboarding.continue
source: Continue
fr: Continuer

# onboarding.requirement.familyName
source: Please enter a family name to continue
fr: Veuillez entrer un nom de famille pour continuer

# onboarding.requirement.members
source: Please add at least one member to continue
fr: Veuillez ajouter au moins un membre pour continuer

# action.save
source: Save Changes
fr: Sauvegarder

# action.cancel
source: Cancel
fr: Annuler

# action.add
source: Add
fr: Ajouter

# action.done
source: Done
fr: Terminé

# action.refresh
source: Refresh
fr: Actualiser

# action.export
source: Export
fr: Exporter

# action.newPlan
source: New Plan
fr: Nouveau plan

# plan.planYourWeek
source: Plan your week
fr: Planifiez votre semaine

# plan.error
source: Error
fr: Erreur

# plan.creating
source: Creating
fr: Création de

# plan.meals
source: meals
fr: repas

# generating.exploring
source: Exploring flavors...
fr: Exploration des saveurs...

# generating.chefs
source: Our chefs are working on your plan...
fr: Nos chefs travaillent sur votre plan...

# generating.discovering
source: Discovering recipes from around the world...
fr: Découverte de recettes du monde...

# generating.creating
source: Creating your personalized menu...
fr: Création de votre menu personnalisé...

# generating.balancing
source: Balancing flavors and nutrients...
fr: Équilibre des saveurs et nutriments...

# generating.finishing
source: Final touches to your plan...
fr: Dernières touches à votre plan...

# shopping.noList
source: No shopping list
fr: Aucune liste d'épicerie

# shopping.generatedOn
source: Generated on
fr: Générée le

# shopping.order
source: Order
fr: Ordre

# shopping.export
source: Export to
fr: Exporter vers

# shopping.exportShare
source: Share (Google Keep, etc.)
fr: Partager (Google Keep, etc.)

# shopping.exportCopy
source: Copy text
fr: Copier le texte

# shopping.exportTitle
source: Export
fr: Exportation

# shopping.accessDenied
source: Access to reminders denied. Please allow access in Settings.
fr: Accès aux rappels refusé. Veuillez autoriser l'accès dans les Réglages.

# shopping.errorSaving
source: Error saving
fr: Erreur lors de la sauvegarde

# shopping.copied
source: List copied to clipboard
fr: Liste copiée dans le presse-papiers

# adhoc.recipeIdea
source: Recipe Idea
fr: Idée de recette

# adhoc.servings
source: Servings
fr: Portions

# adhoc.servingsCount
source: servings
fr: portions

# adhoc.photoInstructions
source: Instructions (optional)
fr: Instructions (optionnel)

# adhoc.photoInstructionsPlaceholder
source: e.g., I have shrimp, make an Asian dish
fr: Ex.: J'ai des crevettes, faire un plat asiatique

# adhoc.useConstraints
source: Respect family constraints
fr: Respecter les contraintes familiales

# adhoc.useConstraints.footer
source: Include family allergies and dietary preferences in the recipe generation
fr: Inclure les allergies et préférences alimentaires de la famille dans la génération de la recette

# recipe.detectedIngredients
source: Detected Ingredients
fr: Ingrédients détectés

# count.diets
source: diet(s)
fr: régime(s)

# count.allergens
source: allergen(s)
fr: allergène(s)

# count.dislikes
source: dislike(s)
fr: non aimé(s)

# plan.selectMeals
source: Select the meals to plan
fr: Sélectionnez les repas à planifier

# plan.generating
source: Generating...
fr: Génération...

# plan.generateList
source: Generate list
fr: Générer la liste

# plan.mealsSelected
source: meals selected
fr: repas sélectionnés

# shopping.generateFirst
source: Generate a meal plan first, then come back here to see your shopping list.
fr: Générez un plan de repas d'abord, puis revenez ici pour voir votre liste d'épicerie.

# shopping.itemsAdded
source: items added to Reminders
fr: articles ajoutés aux Rappels

# add_meal.title
source: Add Meal
fr: Ajouter un repas

# add_meal.day
source: Day
fr: Jour

# add_meal.select_day
source: Select Day
fr: Sélectionner le jour

# add_meal.meal_type
source: Meal Type
fr: Type de repas

# add_meal.select_meal_type
source: Select Meal Type
fr: Sélectionner le type de repas

# add_meal.manual_entry
source: Manual Entry
fr: Saisie manuelle

# add_meal.enter_title
source: Enter recipe title
fr: Entrer le titre de la recette

# add_meal.generate_from_title
source: Generate from Title
fr: Générer à partir du titre

# add_meal.manual_entry_footer
source: Enter a recipe name and AI will generate the complete recipe.
fr: Entrez un nom de recette et l'IA générera la recette complète.

# add_meal.ai_generation
source: AI Generation
fr: Génération IA

# add_meal.generate_with_ai
source: Generate with AI
fr: Générer avec l'IA

# add_meal.ai_generation_footer
source: Generate a completely random recipe for this slot.
fr: Générer une recette complètement aléatoire pour ce créneau.

# add_meal.conflict_title
source: Meal Already Exists
fr: Repas déjà existant

# add_meal.conflict_message
source: A meal already exists for this day and time. What would you like to do?
fr: Un repas existe déjà pour ce jour et cette heure. Que voulez-vous faire?

# add_meal.replace
source: Replace
fr: Remplacer

# add_meal.add_anyway
source: Add Anyway
fr: Ajouter quand même

# favorites.title
source: Saved Recipes
fr: Recettes sauvegardées

# favorites.empty
source: No saved recipes yet
fr: Aucune recette sauvegardée

# favorites.empty_description
source: Save your favorite recipes by tapping the heart icon when viewing a recipe.
fr: Sauvegardez vos recettes préférées en appuyant sur l'icône cœur lors de la consultation d'une recette.

# action.save_to_favorites
source: Save to Favorites
fr: Sauvegarder aux favoris

# action.remove_from_favorites
source: Remove from Favorites
fr: Retirer des favoris

# action.validate
source: Validate
fr: Valider

# settings.subscription
source: Subscription
fr: Abonnement

# subscription.status
source: Status
fr: Statut

# subscription.status.active
source: Active
fr: Actif

# subscription.status.trial
source: Trial
fr: Essai

# subscription.status.free
source: Free
fr: Gratuit

# subscription.status.developer
source: Developer
fr: Développeur

# subscription.trialEnded
source: Your free trial has ended
fr: Votre essai gratuit est terminé

# subscription.monthly
source: Monthly
fr: Mensuel

# subscription.yearly
source: Annual
fr: Annuel

# subscription.monthly.description
source: Full access to all features
fr: Accès complet à toutes les fonctionnalités

# subscription.yearly.description
source: Best value - Save $10 per year
fr: Meilleure valeur - Économisez 10$ par année

# subscription.save
source: Save %@
fr: Économisez %@

# subscription.subscribe
source: Subscribe
fr: S'abonner

# subscription.subscribe.now
source: Subscribe Now
fr: S'abonner maintenant

# subscription.restore
source: Restore Purchases
fr: Restaurer les achats

# subscription.restore.notfound
source: No purchases found to restore
fr: Aucun achat trouvé à restaurer

# subscription.manage
source: Manage Subscription
fr: Gérer l'abonnement

# subscription.terms
source: Terms of Service
fr: Conditions d'utilisation

# subscription.privacy
source: Privacy Policy
fr: Politique de confidentialité

# subscription.autorenewal
source: Payment will be charged to your iTunes Account. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Manage or cancel anytime in App Store settings.
fr: Le paiement sera débité de votre compte iTunes. L'abonnement se renouvelle automatiquement sauf si le renouvellement automatique est désactivé au moins 24 heures avant la fin de la période en cours. Gérez ou annulez à tout moment dans les réglages de l'App Store.

# subscription.error
source: Error
fr: Erreur

# subscription.error.verification
source: Failed to verify purchase
fr: Échec de la vérification de l'achat

# subscription.error.purchase
source: Purchase failed
fr: L'achat a échoué

# subscription.error.notfound
source: Product not found
fr: Produit non trouvé

# subscription.period.day
source: day
fr: jour

# subscription.period.days
source: days
fr: jours

# subscription.period.week
source: week
fr: semaine

# subscription.period.weeks
source: weeks
fr: semaines

# subscription.period.month
source: month
fr: mois

# subscription.period.months
source: months
fr: mois

# subscription.period.year
source: year
fr: année

# subscription.period.years
source: years
fr: années

# subscription.trial.days
source: %d days free trial
fr: %d jours d'essai gratuit

# subscription.trial.weeks
source: %d weeks free trial
fr: %d semaines d'essai gratuit

# subscription.trial.months
source: %d months free trial
fr: %d mois d'essai gratuit

# subscription.trial.years
source: %d years free trial
fr: %d années d'essai gratuit

# subscription.trial.remaining
source: Trial Days Remaining
fr: Jours d'essai restants

# subscription.trial.daysLeft
source: days
fr: jours

# subscription.welcome
source: 🎉 7 Days Free!
fr: 🎉 7 jours gratuits !

# subscription.welcome.message
source: Enjoy all features free for 7 days
fr: Profitez de toutes les fonctionnalités gratuitement pendant 7 jours

# subscription.feature.planning
source: Weekly meal planning with AI
fr: Planification hebdomadaire des repas avec IA

# subscription.feature.shopping
source: Smart shopping lists
fr: Listes d'épicerie intelligentes

# subscription.feature.ai
source: AI-powered recipe generation
fr: Génération de recettes par IA

# subscription.feature.adhoc
source: Ad-hoc instant recipes
fr: Recettes instantanées ad-hoc

# subscription.feature.family
source: Unlimited family members
fr: Membres de famille illimités

# subscription.developer.code
source: Developer Access Code
fr: Code d'accès développeur

# subscription.developer.remove
source: Remove Developer Access
fr: Retirer l'accès développeur

# subscription.locked.title
source: Premium Feature
fr: Fonctionnalité Premium

# subscription.locked.description
source: Subscribe to unlock all features and start planning your meals!
fr: Abonnez-vous pour débloquer toutes les fonctionnalités et commencer à planifier vos repas!

# subscription.unlock
source: Subscribe Now
fr: S'abonner maintenant

# legal.title
source: Legal
fr: Légal

# legal.terms.title
source: Terms and Conditions
fr: Conditions d'utilisation

# legal.privacy.title
source: Privacy Policy
fr: Politique de confidentialité

# legal.terms.content
source: TERMS AND CONDITIONS Last updated: January 2025 1. ACCEPTANCE OF TERMS By downloading, accessing, or using Planea ("the App"), you agree to be bound by these Terms and Conditions. If you do not agree to these terms, please do not use the App. 2. DESCRIPTION OF SERVICE Planea is a meal planning application that uses artificial intelligence to generate personalized meal plans, recipes, and shopping lists based on user preferences, dietary restrictions, and family profiles. 3. USER ACCOUNTS 3.1 You are responsible for maintaining the confidentiality of your account information. 3.2 You agree to provide accurate, current, and complete information. 3.3 You are responsible for all activities that occur under your account. 4. SUBSCRIPTION AND PAYMENT 4.1 The App offers subscription plans with a free trial period. 4.2 Subscriptions automatically renew unless cancelled at least 24 hours before the end of the current period. 4.3 Payment will be charged to your iTunes Account at confirmation of purchase. 4.4 You can manage or cancel your subscription through your App Store account settings. 5. AI-GENERATED CONTENT 5.1 The App uses AI to generate meal plans and recipes. 5.2 While we strive for accuracy, we do not guarantee the nutritional accuracy or suitability of generated content. 5.3 Users with severe allergies or specific dietary requirements should verify all recipes and ingredients. 5.4 We are not responsible for any health issues arising from following AI-generated recipes. 6. USER CONTENT 6.1 You retain ownership of any content you create within the App. 6.2 By using the App, you grant us a license to use your data to improve our services. 6.3 We may use anonymized data for research and development purposes. 7. INTELLECTUAL PROPERTY 7.1 The App and its original content, features, and functionality are owned by Planea and are protected by international copyright, trademark, and other intellectual property laws. 8. PROHIBITED USES You may not: - Use the App for any illegal purpose - Attempt to gain unauthorized access to the App or its systems - Interfere with or disrupt the App or servers - Reverse engineer or attempt to extract the source code 9. DISCLAIMER OF WARRANTIES The App is provided "as is" and "as available" without warranties of any kind, either express or implied. 10. LIMITATION OF LIABILITY To the maximum extent permitted by law, Planea shall not be liable for any indirect, incidental, special, consequential, or punitive damages. 11. CHANGES TO TERMS We reserve the right to modify these terms at any time. Continued use of the App after changes constitutes acceptance of the new terms. 12. GOVERNING LAW These terms shall be governed by and construed in accordance with the laws of Canada. 13. CONTACT For questions about these Terms, please contact us through the App's feedback feature or at dreyerfred+planea@gmail.com.
fr: CONDITIONS D'UTILISATION Dernière mise à jour : Janvier 2025 1. ACCEPTATION DES CONDITIONS En téléchargeant, accédant ou utilisant Planea ("l'Application"), vous acceptez d'être lié par ces Conditions d'utilisation. Si vous n'acceptez pas ces conditions, veuillez ne pas utiliser l'Application. 2. DESCRIPTION DU SERVICE Planea est une application de planification de repas qui utilise l'intelligence artificielle pour générer des plans de repas personnalisés, des recettes et des listes d'épicerie basés sur les préférences de l'utilisateur, les restrictions alimentaires et les profils familiaux. 3. COMPTES UTILISATEUR 3.1 Vous êtes responsable du maintien de la confidentialité des informations de votre compte. 3.2 Vous acceptez de fournir des informations exactes, à jour et complètes. 3.3 Vous êtes responsable de toutes les activités qui se produisent sous votre compte. 4. ABONNEMENT ET PAIEMENT 4.1 L'Application offre des plans d'abonnement avec une période d'essai gratuite. 4.2 Les abonnements se renouvellent automatiquement sauf annulation au moins 24 heures avant la fin de la période en cours. 4.3 Le paiement sera débité de votre compte iTunes à la confirmation de l'achat. 4.4 Vous pouvez gérer ou annuler votre abonnement via les paramètres de votre compte App Store. 5. CONTENU GÉNÉRÉ PAR IA 5.1 L'Application utilise l'IA pour générer des plans de repas et des recettes. 5.2 Bien que nous nous efforcions d'être précis, nous ne garantissons pas l'exactitude nutritionnelle ou la pertinence du contenu généré. 5.3 Les utilisateurs ayant des allergies graves ou des exigences alimentaires spécifiques doivent vérifier toutes les recettes et ingrédients. 5.4 Nous ne sommes pas responsables des problèmes de santé résultant de recettes générées par IA. 6. CONTENU UTILISATEUR 6.1 Vous conservez la propriété de tout contenu que vous créez dans l'Application. 6.2 En utilisant l'Application, vous nous accordez une licence d'utilisation de vos données pour améliorer nos services. 6.3 Nous pouvons utiliser des données anonymisées à des fins de recherche et développement. 7. PROPRIÉTÉ INTELLECTUELLE 7.1 L'Application et son contenu original, ses fonctionnalités et ses fonctions sont la propriété de Planea et sont protégés par les lois internationales sur le droit d'auteur, les marques de commerce et autres lois sur la propriété intellectuelle. 8. UTILISATIONS INTERDITES Vous ne pouvez pas : - Utiliser l'Application à des fins illégales - Tenter d'obtenir un accès non autorisé à l'Application ou à ses systèmes - Interférer avec ou perturber l'Application ou les serveurs - Faire de l'ingénierie inverse ou tenter d'extraire le code source 9. CLAUSE DE NON-GARANTIE L'Application est fournie "telle quelle" et "selon disponibilité" sans garanties d'aucune sorte, expresses ou implicites. 10. LIMITATION DE RESPONSABILITÉ Dans toute la mesure permise par la loi, Planea ne sera pas responsable des dommages indirects, accessoires, spéciaux, consécutifs ou punitifs. 11. MODIFICATIONS DES CONDITIONS Nous nous réservons le droit de modifier ces conditions à tout moment. L'utilisation continue de l'Application après les modifications constitue l'acceptation des nouvelles conditions. 12. LOI APPLICABLE Ces conditions seront régies et interprétées conformément aux lois du Canada. 13. CONTACT Pour toute question concernant ces Conditions, veuillez nous contacter via la fonction de feedback de l'Application ou à dreyerfred+planea@gmail.com.
